#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # panos_antivirus_security_profile.example will be created
  + resource "panos_antivirus_security_profile" "example" {
      + description  = "example AV profile"
      + device_group = "policy-as-code"
      + id           = (known after apply)
      + name         = "av"
      + vsys         = "vsys1"

      + application_exception {
          + action      = "alert"
          + application = "hotmail"
        }

      + decoder {
          + action          = "default"
          + name            = "smtp"
          + wildfire_action = "default"
        }
      + decoder {
          + action          = "default"
          + name            = "smb"
          + wildfire_action = "default"
        }
      + decoder {
          + action          = "default"
          + name            = "pop3"
          + wildfire_action = "default"
        }
      + decoder {
          + action          = "default"
          + name            = "imap"
          + wildfire_action = "default"
        }
      + decoder {
          + action          = "default"
          + name            = "http"
          + wildfire_action = "default"
        }
      + decoder {
          + action          = "default"
          + name            = "http2"
          + wildfire_action = "default"
        }
      + decoder {
          + action          = "reset-both"
          + name            = "ftp"
          + wildfire_action = "default"
        }
    }

  # panos_panorama_device_group.this will be created
  + resource "panos_panorama_device_group" "this" {
      + description = "example device group for policy as code demo"
      + id          = (known after apply)
      + name        = "policy-as-code"

      + device {
          + serial    = (known after apply)
          + vsys_list = (known after apply)
        }
    }

  # panos_panorama_security_rule_group.this will be created
  + resource "panos_panorama_security_rule_group" "this" {
      + device_group = "policy-as-code"
      + id           = (known after apply)
      + rulebase     = "pre-rulebase"

      + rule {
          + action                = "allow"
          + applications          = [
              + "dns",
            ]
          + categories            = [
              + "any",
            ]
          + destination_addresses = [
              + "8.8.8.4",
            ]
          + destination_zones     = [
              + "dmz",
            ]
          + hip_profiles          = [
              + "any",
            ]
          + log_end               = true
          + name                  = "allow dns from apps"
          + services              = [
              + "application-default",
            ]
          + source_addresses      = [
              + "10.0.0.0/8",
            ]
          + source_users          = [
              + "any",
            ]
          + source_zones          = [
              + "app",
            ]
          + type                  = "universal"
          + virus                 = "av"
        }
      + rule {
          + action                = "allow"
          + applications          = [
              + "ssl",
              + "web-browsing",
            ]
          + categories            = [
              + "any",
            ]
          + destination_addresses = [
              + "any",
            ]
          + destination_zones     = [
              + "untrust",
            ]
          + hip_profiles          = [
              + "any",
            ]
          + log_end               = true
          + name                  = "allow internet from bizdev x"
          + services              = [
              + "application-default",
            ]
          + source_addresses      = [
              + "192.168.10.0/24",
            ]
          + source_users          = [
              + "any",
            ]
          + source_zones          = [
              + "bizdev",
            ]
          + type                  = "universal"
          + virus                 = "av"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @migara, Action: `pull_request`*